
///////////////////////////////////////////////////////////////////////////
/** Коды HTTP для обработки ошибок */
///////////////////////////////////////////////////////////////////////////

/** код ответа, если данные получены или запрос обработан */
export const HTTP_200_STATUS_OK = 200

/** Код ответа, если невозможно обработать сущность */
export const HTTP_422_UNPROCESSABLE_ENTITY = 422

/** Код ответа, если по запросу ничего не найдено */
export const HTTP_404_NOT_FOUND = 404

/** Код ответа, если пользователь неавторизован */
export const HTTP_401_UNAUTHORIZED = 401

/** Код ответа, если такой запрос запрещён */
export const HTTP_403_FORBIDDED = 403

/** Код ответа, если слишком много запросов */
export const HTTP_429_TOO_MANY_REQUESTS = 429