
/**
 * Константы для сети
 */
export const NetworkConstants = {

    /**
     * Стандартное время ожидания ответа в миллисекундах
     */
    DEFAULT_TIMEOUT: 15000,

    /**
     * Долгое время ожидания ответа в миллисекундах
     */
    LONG_TIMEOUT: 30000,

    /**
     * Стандартный лимит элементов для отображения для запросов
     */
    DEFAULT_LIMIT: 12,

    /**
     * Большой лимит элементов для отображения для запросов
     */
    BIG_LIMIT: 30,

    /**
     * Стандартное значение, если не найдено id пользователя
     */
    NO_ID: -1,

    /**
     * Максимальное количество данных от сервера на одной странице
     */
    MAX_LIMIT: 1000
}